rp.cfg = rp.cfg or {}

rp.cfg.StartMoney     = 400 -- 5
rp.cfg.PayDayTime = 600 -- in seconds
rp.cfg.StartKarma   = 20

rp.cfg.OrgCost      = 25000

rp.cfg.HungerTake     = 0.125 -- за 10 секунд
rp.cfg.DefaultThirstRate = 0.25 -- за 10 секунд
rp.cfg.DefaultThirstDamage = 5
rp.cfg.DefaultColdRate = 0.4 -- за 10 секунд


rp.cfg.DoorCostMin    = 200
rp.cfg.DoorCostMax    = 20000
rp.cfg.PropertyTax    = 5

rp.cfg.PropLimit    = 25

rp.cfg.RagdollDelete  = 60

-- Speed
rp.cfg.WalkSpeed    = 100 --180
rp.cfg.RunSpeed     = 250 --280

-- Printers
rp.cfg.PrintDelay     = 180
rp.cfg.PrintAmount    = 1000
rp.cfg.InkCost      = 200

-- Hits
rp.cfg.HitExpire    = 600
rp.cfg.HitCoolDown    = 300
rp.cfg.HitMinCost     = 2000
rp.cfg.HitMaxCost     = 100000

-- Afk
rp.cfg.AfkDemote    = (60*20)
rp.cfg.AfkPropRemove  = (60*60)
rp.cfg.AfkDoorSell    = (60*60)

--Weapons
rp.cfg.ironshoot = false

-- Lotto
rp.cfg.MinLotto     = 1000
rp.cfg.MaxLotto     = 1000000

rp.cfg.FoodEntitiesForInventory = {'fs_cabbage_seeds', 'fs_apple_seeds'}


rp.cfg.CreditsURL     = 'url'

rp.cfg.whitelistHandler   = 'http://octopus-project.ru/darkrp/propwhitelist.php'

rp.cfg.DefaultLaws    = [[
Умышленное и неумышленное убийство, причинение вреда гражданам (кроме самообороны) и удержание взаперти против их воли наказуемо.
Запрещено воровать и вламываться в чужие дома, портить частное и городское имущество.
Денежные принтеры запрещены и подлежат уничтожению. Гражданин, хранящий или переносящий принтеры, подлежит аресту, вне зависимости от владельца принтера.
Ношение, хранение, продажа, сбыт, применение оружия требуют лицензии.
Запрещается открытое ношение оружия в общественных местах, даже при наличии лицензии.
Производство, хранение и сбыт наркотиков запрещены.
Оскорбление или сопротивление силам правопорядка является нарушением закона.
Укрывательство преступников и разыскиваемых является преступлением.
Проникновение в государственные учреждения дальше запрещающей таблички карается арестом.
Полиция может применять летальное оружие только при угрозе для жизни сотрудника полиции или граждан.
Во время комендантского часа граждане (кроме городских служб) обязаны прибыть в свои дома и не покидать их, если иное не указано в пояснении к комендантскому часу.
Сбежавший из тюрьмы заключённый подлежит аресту на повторный срок.
Мэру и Офицерам Полиции запрещается заниматься любой нелегальной деятельностью или участвовать в организованных преступных группировках. Любой провинившийся подлежит увольнению и наказанию.]]

rp.cfg.DisallowDrop = {
  arrest_stick  = true,
  door_ram    = true,
  gmod_camera   = true,
  gmod_tool     = true,
  keys      = true,
  med_kit     = true,
  pocket      = true,
  stunstick     = false,
  unarrest_stick  = false,
  weapon_keypadchecker = true,
  weapon_physcannon = true,
  weapon_physgun  = true,
  weaponchecker   = true,
  weapon_fists  = true
}

rp.cfg.DefaultWeapons = {
  -- 'weapon_physcannon',
  -- 'weapon_physgun',
  -- 'gmod_tool',
  "item_lighter",
  "tfa_nmrih_fists",
  'weapon_rphands',
}

-- Spawn
rp.cfg.SpawnDisallow = {
  prop_physics    = true,
  media_radio     = true,
  media_tv      = true,
  ent_textscreen    = true,
  ent_picture     = true,
  gmod_rtcameraprop = true,
  metal_detector    = true
}

rp.cfg.RemoveMapProps = {
  1785, 1797, 1801, 1788, 1794, 1820, 1818, 1806, 1816, 1790, 1789, 1793, 1787, 1786, 1798, 1799, 1800, 1802, 1804, 1805, 1817, 1821, 1819, 1803, 1792, 1796, 1795, 1791, 2053, 2054, 2055, 2052, 2051, 2056, 2050, 2049, 2048, 2047, 2046, 2045, 2062, 2059, 2057, 2060, 2058, 2061, 2064, 2067, 2066, 2063, 2065, 2068, 2038, 2043, 2034, 2040, 2037, 2035, 2036, 2038, 2037, 2035, 2036, 2042, 2040, 2043, 2034, 2033, 2032, 2041, 2039, 2104, 2106, 2105, 2101, 2102, 2103, 2100, 2099, 2098, 2095, 2096, 2097, 2093, 2094, 2090, 2091, 2092, 2089, 2088, 2087, 2085, 2086, 2081, 2080, 2079, 2076, 2077, 2078, 2073, 2074, 2075, 2084, 2083, 2082, 1325, 1324, 1328, 1327, 1326, 1329, 1322, 1323, 1386, 1319, 1318, 1321, 1330, 1332, 1333, 1404, 1403, 2223, 2260, 1340, 1338, 1339, 1337, 1335, 1334, 1336, 1355, 1354, 1346, 1351, 1350, 1347, 1348, 1349, 1353, 1352, 1345, 1344, 1343, 1341, 1342, 1358, 1374, 1371, 1370, 1368, 1364, 1365, 1367, 1366, 1369, 1372, 1431, 1429, 1430, 1373, 2222, 2218, 2220, 2219, 2221, 1357, 1356, 1842, 1841, 1843, 1828, 1829, 1830, 1832, 1835, 2241, 1836, 1825, 1739, 1738, 1853, 1884, 1888, 1767, 1766, 1764, 1765, 1530, 1531, 1532, 1529, 1497, 1496, 1495, 1498, 1763, 1762, 1754, 1755, 1756, 1757, 1637, 1745, 1750, 1751, 1752, 1753, 1748, 1749, 1746, 1747, 1630, 1603, 1235, 1606, 1605, 1607, 1609, 1610, 1611, 1612, 1614, 1613, 1591, 1592, 1594, 1593, 1596, 1595, 1235, 1598, 1599, 1600, 1602, 2224, 2227, 2228, 2226, 2225, 1709, 1708, 1710, 1760, 1761, 1259, 2255, 2257, 2258, 2252, 2250, 2249, 2247, 1506, 1505, 1507, 1504, 1545, 1543, 1544, 1559, 1558, 1557, 1552, 1551, 1550, 1532, 1531, 1530, 1529, 2259, 2253, 2251, 2248, 2246, 2256, 2254, 1421, 1420, 1423, 1458, 1455, 1457, 1456, 1295, 1293, 1294, 1302, 1902, 1901, 1299, 1277, 1284, 1283,1547, 1465, 1472, 1468, 2276, 2270, 2267, 2264, 2265, 2271, 2273, 2274, 2291, 2290, 2289, 2292, 2293, 2229, 2029, 2017, 2015, 2016, 2028, 2031, 2026, 2021, 2020, 2019, 2022, 2025, 2030, 2027, 2024, 2023, 2018, 2044, 1814, 1815, 2231, 2230, 1758, 1759, 1911, 1904, 1905, 1908, 1910, 1909, 1906, 1907, 2150, 2148, 2151, 2156, 2155, 2157, 2159, 2164, 2161, 2166, 2128, 2130, 2132, 2139, 2141, 2143, 2145, 2136, 2134, 2138, 1579, 1580, 1586, 1587, 1588, 1235, 1590, 1585, 1584, 1583, 1601, 1597, 1881, 1882, 1240, 1241, 1239, 1238, 1645, 1644, 1641, 1640, 1646, 1419, 1657
}

rp.cfg.Spawns = {
  dayz_ghosttown = {
		Vector(-12982.985351563, 13140.178710938, 1126.5718994141),
		Vector(-15354.157226563, 15334.146484375, 1967.3100585938),
  },
}


rp.cfg.TeamSpawns = rp.cfg.TeamSpawns or {
  dayz_ghosttown = {
  --  Vector(2933, 8651, 328),
  },
  rp_asheville = {

  },
  rp_c18_sup_b1 = {

  },
  rp_downtown_v4c_v2 = {

  }
}

rp.cfg.SpawnPos = rp.cfg.SpawnPos or {
   dayz_ghosttown = {
      Vector(-10309.37109375, 14892.103515625, 507.43035888672),
      Vector(-11034.166015625, 14928.466796875, 757.71325683594),
      Vector(-11985.19140625, 14836.599609375, 1016.3055419922),
      Vector(-12832.8984375, 14836.530273438, 1258.5544433594),
      Vector(-11724.915039063, 14793.6953125, 962.67095947266),
      Vector(-12216.3671875, 14674.76953125, 1030.3120117188),
      Vector(-11177.276367188, 14808.797851563, 794.5498046875),
      Vector(-10124.16015625, 14614.958984375, 452.13784790039),
      Vector(-9834.33984375, 14570.940429688, 443.28817749023),
      Vector(-9695.4052734375, 14239.525390625, 458.88543701172),
      Vector(-8891.6953125, 14744.982421875, 690.33258056641),
      Vector(-8336.90234375, 14647.336914063, 894.94372558594),
      Vector(-8300.916015625, 14818.825195313, 893.1474609375),
      Vector(-7743.169921875, 14834.805664063, 908.47387695313),
      Vector(-7729.4423828125, 14650.344726563, 905.43414306641),
      Vector(-9255.9052734375, 14219.24609375, 524.54516601563),
      Vector(-9449.2158203125, 14642.400390625, 516.07244873047),
      Vector(-14939.485351563, 12492.994140625, 1126.3992919922),
      Vector(-14930.33984375, 12172.61328125, 1069.4885253906),
      Vector(-14826.169921875, 11984.3359375, 1055.0439453125),
      Vector(-14910.813476563, 11801.518554688, 1038.8708496094),
      Vector(-14857.546875, 11659.256835938, 993.53894042969),
      Vector(-14697.19140625, 11736.3046875, 980.84063720703),
      Vector(-14679.944335938, 11486.159179688, 885.48809814453),
      Vector(-14814.557617188, 11240.619140625, 829.98657226563),
      Vector(-14852.166992188, 11347.296875, 872.38916015625),
      Vector(-14888.654296875, 10979.275390625, 777.04364013672),
      Vector(-14583.8046875, 10974.390625, 793.54791259766),
      Vector(-15037.000976563, 11372.801757813, 915.62316894531),
      Vector(-14952.959960938, 10695.137695313, 768.40765380859),
      Vector(-14966.955078125, 10210.807617188, 768.32751464844)
    },
    rp_asheville = {
      Vector(-11682.052734, 12050.950195, 167.605743),
      Vector(-11571.720703, 12054.808594, 159.413818),
      Vector(-11478.725586, 12058.716797, 149.730835),
      Vector(-11328.495117, 12073.007813, 131.032578),
      Vector(-11271.280273, 11945.019531, 126.791695),
      Vector(-11357.238281, 11865.335938, 131.960663),
      Vector(-11471.508789, 11858.259766, 139.969528),
      Vector(-11576.497070, 11807.617188, 142.222351),
      Vector(-11680.602539, 11778.473633, 144.504684),
      Vector(-11767.365234, 11897.512695, 158.45320),
      Vector(-11773.270508, 11953.573242, 163.55554),  
    }
}

-- Jail
rp.cfg.WantedTime   = 180
rp.cfg.WarrantTime    = 180
rp.cfg.ArrestTimeMin  = 120
rp.cfg.ArrestTimeMax  = 600

rp.cfg.Jails = {
  rp_florida_v2 = {
    Vector(6112.072754, -2762.958252, -283.028351),
    Vector(6954.748047, -3325.131348, 27.69620),
  },
}

rp.cfg.JailPos = {
  rp_florida_v2 = {
    Vector(6281, -3145, -184),
    Vector(6440, -3147, -184),
    Vector(6576, -3147, -184),
    Vector(6714, -3147, -184),
  },
}

rp.cfg.DamageFactors = { 
  [1] = 1, -- Head
  [2] = 2, -- Chest
  [3] = 3, -- Belly
  [4] = 4, -- Left arm
  [5] = 4, -- Right arm
  [6] = 4.9, -- Left leg
  [7] = 4.9, -- Right leg
}

-- Automated announcements
rp.cfg.AnnouncementDelay = 220
rp.cfg.Announcements = {
  'Хотите подать жалобу? Напишите в чате: @ Текст жалобы.',
  'Контент: https://vk.cc/ahVql0',
  'Добавь сервер в Избранное - 46.174.49.79:27015',
  'Вы можете активировать свои купоны через F6->Активировать промокод',
  'Советуем хранить ваши сбережения на складе!',
  'Донат - F6 или /donate',
  'Сообщайте о багах в наш Discord-сервер! discord.gg/ngHafFe',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
  -- 'Проводится набор в администрацию! Написать заявку можно тут - https://vk.com/topic-130683359_40392383',
}
