rp.Notes = rp.Notes or {}

rp.Notes["Тестовая записка"] = {
	pos = Vector(-5969.509277, -12609.066406, 31.725342),
	ang = Angle(-0.129, -42.550, 0.033),
	header = "Пацанам",
	text = [[
Кто тронет мою пачку сигарет - пущу пулю в лоб.

Сиплый
	]]
}

rp.Notes["Рецепт 'Эффералган'"] = {
	pos = Vector(11385.982422, 313.830444, -117.836418),
	ang = Angle(0.511, -11.332, -0.057),
	header = "Рецепт 'Эффералган'",
	text = [[
Эффералган® (Efferalgan®) инструкция по применению


Владелец регистрационного удостоверения:
UPSA, SAS (Франция)
Контакты для обращений:
БРИСТОЛ-МАЙЕРС СКВИББ (США)
Код ATX: N02BE01 (Paracetamol)
Активное вещество: парацетамол (paracetamol)
Rec.INN зарегистрированное ВОЗ
Лекарственная форма
Препарат разрешен к применению в качестве средств безрецептурного отпуска	Эффералган®	
Таб. шипучие 500 мг: 16 шт.
рег. №: П N011549/01 от 09.07.10 - Бессрочно
Форма выпуска, упаковка и состав препарата Эффералган®
Таблетки шипучие белого цвета, круглые, плоские, со скошенными краями и риской на одной стороне; при растворении в воде наблюдается интенсивное выделение пузырьков газа.

1 таб. 500 мг.
Вспомогательные вещества: лимонная кислота безводная - 1114 мг, натрия гидрокарбонат- 942 мг, натрия карбонат безводный - 332 мг, сорбитол - 300 мг, натрия сахаринат - 7 мг, натрия докузат - 0.227 мг, повидон K30 - 1.287 мг, натрия бензоат - 60.606 мг.

4 шт. - стрипы (4) - пачки картонные.

Клинико-фармакологическая группа: Анальгетик-антипиретик
Фармако-терапевтическая группа: Анальгезирующее ненаркотическое средство
Фармакологическое действие
Парацетамол обладает анальгезирующим, жаропонижающим и крайне слабым противовоспалительным действием, что связано с его влиянием на центр терморегуляции в гипоталамусе и слабовыраженной способностью ингибировать синтез простагландинов в периферических тканях.

Показания препарата Эффералган®
в качестве жаропонижающего средства при гриппе и других инфекционно-воспалительных заболеваниях, сопровождающихся повышением температуры тела(лихорадкой);
в качестве обезболивающего средства при болевом синдроме слабой или умеренной выраженности: артралгия, миалгия, невралгия, мигрень, зубная и головная боль, альгодисменорея, боли при травмах и ожогах.

Режим дозирования:
Препарат принимают внутрь, не пережёвывая, запивая водой.
Принимать по 1 таблетке раз в 30 минут. Курс полного лечения состоит из приёма 3-х таблеток.

Побочное действие:
При применении препарата отмечались указанные ниже побочные эффекты (частота не установлена).
Аллергические реакции: реакции гиперчувствительности, кожный зуд, сыпь на коже и слизистых (эритема или крапивница), отек Квинке, многоформная экссудативная эритема (в т.ч. синдром Стивенса-Джонсона), токсический эпидермальный некролиз (синдром Лайелла), анафилактический шок, острый генерализованный экзантематозный пустулез.
Со стороны дыхательной системы: бронхоспазм.
Со стороны центральной и периферической нервной системы (при приеме высоких доз): головокружение, психомоторное возбуждение и нарушение ориентации в пространстве и времени.
Со стороны пищеварительной системы: тошнота, рвота, диарея, боль в эпигастрии, повышение активности печеночных ферментов, как правило, без развития желтухи, гепатонекроз (дозозависимый эффект), гепатит, тенезмы, печеночная недостаточность.
Со стороны почек и мочевыводящих путей: повышение креатинина.
Со стороны эндокринной системы: гипогликемия, вплоть до гипогликемической комы.
Со стороны системы кроветворения: анемия (цианоз), сульфогемоглобинемия, метгемоглобинемия (одышка, боли в сердце), гемолитическая анемия (особенно у больных с дефицитом глюкозо-6-фосфатдегидрогеназы), тромбоцитопения, нейтропения, лейкопения.
Прочие: снижение АД (как симптом анафилаксии), изменение протромбинового времени и МНО.

Противопоказания к применению:
повышенная чувствительность к парацетамолу, пропацетамолу гидрохлориду (пролекарство парацетамола) или любому другому компоненту препарата;
выраженная печеночная недостаточность или декомпенсированные заболевания печени в острой стадии;
дефицит сахаразы/изомальтазы, непереносимость фруктозы, глюкозо-галактозная мальабсорбция;
детский возраст до 12 лет.

Передозировка:
При передозировке возможна интоксикация, особенно у детей, пациентов с заболеваниями печени (вызванных хроническим алкоголизмом), у пациентов с нарушениями питания, а также у пациентов, принимающих индукторы ферментов, при которой могут развиться молниеносный гепатит, печеночная недостаточность, холестатический гепатит, цитолитический гепатит, в указанных выше случаях - иногда с летальным исходом. Клиническая картина острой передозировки развивается в течение 24 ч после приема парацетамола.
]]
}

rp.Notes["Рецепт 'Тамифлю'"] = {
	pos = Vector(9365.560547, 600.596069, 1233.398560),
	ang = Angle(-0.096, 67.949, -0.064),
	header = "Тамифлю®",
	text = [[
Тамифлю® (Tamiflu®) инструкция по применению

Состав:
Капсулы	1 капс.
активное вещество:	 
осельтамивир 75 мг
(в виде осельтамивира фосфата 98,5 мг)	 
вспомогательные вещества: крахмал прежелатинизированный; повидон К30; кроскармеллоза натрия; тальк; натрия стеарилфумарат	 
оболочка капсулы:
корпус: желатин; краситель железа оксид черный (Е172); титана диоксид (Е171)	 
крышечка: желатин; краситель железа оксид красный (Е172); краситель железа оксид желтый (Е172); титана диоксид (Е171)	 
чернила для нанесения надписи на капсуле: этанол; шеллак; бутанол; титана диоксид (Е171); лак алюминиевый на основе индигокармина; этанол денатурированный (спирт метилированный)

Фармакологическое действие:
Фармакологическое действие — противовирусное.

Способ применения и дозы:
Внутрь, во время еды или независимо от приема пищи. Переносимость препарата можно улучшить, если принимать его во время еды.

Взрослые, подростки или дети, которые не могут проглотить капсулу, также могут получать лечение Тамифлю® в лекарственной форме порошок для приготовления суспензии для приема внутрь.

В случаях, когда Тамифлю® в лекарственной форме порошок для приготовления суспензии для приема внутрь отсутствует, или при наличии признаков старения капсул (например повышенная хрупкость или другие нарушения физического состояния) необходимо открыть капсулу и высыпать ее содержимое в небольшое количество (максимально 1 ч. ложка) подходящего подслащенного продукта питания (шоколадный сироп с нормальным содержанием сахара или без содержания сахара, мед, светло-коричневый сахар или столовый сахар, растворенный в воде, сладкий десерт, сгущенное молоко с сахаром, яблочное пюре или йогурт) для того, чтобы скрыть горький вкус. Смесь необходимо тщательно перемешать и дать пациенту целиком. Следует проглотить смесь сразу же после приготовления. Подробные рекомендации даны в разделе Экстемпоральное приготовление суспензии Тамифлю®.

Стандартный режим дозирования:
Препарат принимают внутрь, не пережёвывая, запивая водой.
Принимать по 1 таблетке раз в 40 минут. Курс полного лечения состоит из приёма 4-х таблеток.
]]
}

rp.Notes["Рецепт 'Амоксициллин'"] = {
	pos = Vector(5201.148438, 654.461548, 27.507061),
	ang = Angle(-0.456, 5.348, 0.594),
	header = "Амоксициллин",
	text = [[
Амоксициллин® (Amoxicillin®) инструкция по применению

Капсуловидные таблетки белого или почти белого цвета с риской.
Фармакотерапевтическая группа: антибиотик - пенициллин полусинтетический
Код АТХ: J01CA04
Фармакологические свойства
Фармакодинамика
Амоксициллин представляет собой аминобензиловый пенициллин, полусинтетический антибиотик широкого спектра действия, обладающий бактерицидным действием в результате ингибирования синтеза бактериальной клеточной стенки. Пороговые значения минимальной ингибирующей концентрации (МИК) для различных чувствительных микроорганизмов варьируют. Распространенность резистентных штаммов варьирует географически и в разное время, поэтому желательно ориентироваться на местную информацию о резистентности, особенно при лечении тяжелых инфекций.

Форма выпуска и состав
Аптеки предлагают амоксициллин в таблетках и капсулах по 250 и 500 мг. Продолговатые таблетки покрыты защитной оболочкой желтовато-белого цвета. Каждая таблетка имеет удобную дозировочную насечку с каждой стороны.

Основное действующее вещество – тригидрат амоксициллина. К вспомогательным компонентам относятся стеарат магния, поливидон, крахмала натрия гликолат и микрокристаллическая целлюлоза. Пленочная облатка состоит из диоксида титана, талька и гипромеллозы.

Показания к применению
Антибиотик широкого спектра действия помогает избавиться от различных инфекций, которые соответственно поражают различные органы и системы. Как правило, врачи рекомендуют этот препарат для лечения инфекционных заболеваний, вызванных развитием стрептококков. Среди самых распространенных болезней такого происхождения:

инфекции верхних дыхательных путей и ЛОР-органов (отит, гайморит, ангина, фронтит);
бактериальные заболевания нижних дыхательных путей (внебольничная пневмония, острый бронхит и хронический бронхит, перешедший в острую стадию);
болезни почек и мочевыводящих путей (цистит, пиелонефрит);
кишечные инфекции (энтерит, колит);
инфекционные поражения кожи и мягких тканей (флегмона, абсцесс, рожа);
Все показания к применению (инструкция)
В сочетании с метронидазолом таблетки Амоксициллина эффективны при терапии хронического гастрита, а также язвенной болезни желудка и двенадцатиперстной кишки.

Противопоказания
Повышенная чувствительность к амоксициллину, другим бета-лактамным антибиотикам (другим пенициллинам, цефалоспоринам, монобактамам, карбапенемам) или любым компонентам препарата;
инфекционный мононуклеоз, лимфолейкоз;
дети до 3-х лет (для данной лекарственной формы).

Способ применения и дозы
Оптимальную терапевтическую дозу назначает лечащий врач. Самолечение очень опасно, поскольку каждая инфекция предполагает особый режим приема препарата. Предельное суточное количество лекарственного средства – 3 г.
Принимать по 1 капсуле раз в полтора часа. Курс полного лечения состоит из 3-х таблеток.
]]
}


function SpawnNote(note)
	local noteEnt = ents.Create( "ent_notepad" )
	noteEnt:SetPos( note.pos )
	noteEnt:SetAngles( note.ang )
	noteEnt:Spawn()
	noteEnt:SetBakedInfo(note.header, note.text)
	
	noteEnt:PhysicsInit(SOLID_VPHYSICS)
	noteEnt:SetMoveType(MOVETYPE_NONE)
	noteEnt:SetSolid(SOLID_VPHYSICS)
	
	noteEnt:SetCollisionGroup(COLLISION_GROUP_PASSABLE_DOOR) 
	noteEnt:SetUseType(SIMPLE_USE)
end

hook.Add( "InitPostEntity", "rp.Notes.SpawnNotes", function()
	for name, note in pairs(rp.Notes) do
		SpawnNote(note)
	end
end )